* TODO Part I: Development[0%]

** TODO Setting up the development environment[5/6]

*** DONE Creating a new Rails app
    CLOCK: [2016-05-07 Sat 10:30]--[2016-05-07 Sat 10:41] =>  0:11

*** DONE Dockerizing the app
    CLOCK: [2016-05-07 Sat 10:41]--[2016-05-07 Sat 11:36] =>  0:55

*** DONE Adding a resource
    CLOCK: [2016-05-07 Sat 13:50]--[2016-05-07 Sat 14:05] =>  0:15

*** DONE Adding a production-ready Database
    CLOCK: [2016-05-07 Sat 16:52]--[2016-05-07 Sat 17:43] =>  0:51

*** DONE Adding a Search Engine
    CLOCK: [2016-05-07 Sat 21:30]--[2016-05-07 Sat 22:15] =>  0:45

*** TODO Pushing our project to DockerHub
    CLOCK: [2016-05-08 Sun 11:37]--[2016-05-08 Sun 11:45] =>  0:08
    
* Part II: Production[0%]

** TODO Setting up the Production Environment

** TODO Creating an AWS account

** TODO Kubernetes[0/4]

*** TODO Basic concepts

*** TODO Installing kb8 and creating the cluster

*** TODO Creating pods and services for the DB and the SE

*** TODO Creating an RC and a Service for our Application

* Part III: CI[0%]

** TODO Installing Jenkins on AWS

** TODO Installing some plugins

** TODO Configuring our project for deploy

** TODO Running our test suite

** TODO Adding an staging environment

